jmeter/E-Mall-Performance-Test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.5">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="E-Mall微服务压力测试计划" enabled="true">
      <stringProp name="TestPlan.comments">电商微服务系统性能测试计划</stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="用户定义变量" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="baseUrl" elementType="Argument">
            <stringProp name="Argument.name">baseUrl</stringProp>
            <stringProp name="Argument.value">http://localhost:9000</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
          <elementProp name="token" elementType="Argument">
            <stringProp name="Argument.name">token</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
    </TestPlan>

    <hashTree>
      <!-- ==================== 线程组1: 负载测试 ==================== -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="TG1-负载测试-商品列表" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControllerGui" testclass="LoopController" testname="循环控制器" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">3</intProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">150</stringProp>
        <stringProp name="ThreadGroup.ramp_time">30</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>

      <hashTree>
        <!-- 登录获取Token (Setup Thread) -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="登录获取Token" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="用户定义变量" enabled="true">
            <collectionProp name="Arguments.arguments">
              <elementProp name="username" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">true</boolProp>
                <stringProp name="Argument.value">loadtest</stringProp>
                <stringProp name="Argument.name">username</stringProp>
                <boolProp name="HTTPArgument.use_equals">true</boolProp>
              </elementProp>
              <elementProp name="password" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">true</boolProp>
                <stringProp name="Argument.value">password123</stringProp>
                <stringProp name="Argument.name">password</stringProp>
                <boolProp name="HTTPArgument.use_equals">true</boolProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">localhost</stringProp>
          <stringProp name="HTTPSampler.port">9000</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/api/user/login</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
        </HTTPSamplerProxy>

        <hashTree>
          <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="JSON提取器-Token" enabled="true">
            <stringProp name="JSONPostProcessor.referenceNames">authToken</stringProp>
            <stringProp name="JSONPostProcessor.jsonPathExprs">$.data.token</stringProp>
          </JSONPostProcessor>
          <hashTree/>
          <BeanShellPostProcessor guiclass="BeanShellPostProcessorGui" testclass="BeanShellPostProcessor" testname="保存Token到变量" enabled="true">
            <boolProp name="BeanShellPostProcessor.resetInterpreter">false</boolProp>
            <stringProp name="BeanShellPostProcessor.script">
              ${__setProperty(token, ${authToken})}
              log.info("Token saved: " + "${authToken}");
            </stringProp>
          </BeanShellPostProcessor>
          <hashTree/>
        </hashTree>

        <!-- 商品列表请求 -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="GET /api/product/list" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">localhost</stringProp>
          <stringProp name="HTTPSampler.port">9000</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp>
          <stringProp name="HTTPSampler.path">/api/product/list?page=1&amp;size=10</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <stringProp name="HTTPSampler.connect_timeout">10000</stringProp>
          <stringProp name="HTTPSampler.response_timeout">30000</stringProp>
        </HTTPSamplerProxy>

        <hashTree>
          <!-- 响应断言: 状态码200 -->
          <ResponseAssertion guiclass="ResponseAssertionGui" testclass="ResponseAssertion" testname="响应状态码200" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="0">200</stringProp>
            </collectionProp>
            <stringProp name="Assertion.custom_message">响应状态码应为200</stringProp>
            <stringProp name="Assertion.test_type">Contains</stringProp>
            <intProp name="Assertion.test_field">ResponseCode</intProp>
          </ResponseAssertion>
          <hashTree/>

          <!-- 响应断言: 不含error -->
          <ResponseAssertion guiclass="ResponseAssertionGui" testclass="ResponseAssertion" testname="响应不含error" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="0">error</stringProp>
            </collectionProp>
            <stringProp name="Assertion.custom_message">响应中不应包含error</stringProp>
            <stringProp name="Assertion.test_type">NotContains</stringProp>
            <intProp name="Assertion.test_field">ResponseData</intProp>
          </ResponseAssertion>
          <hashTree/>

          <!-- Duration Assertion: P95目标<1秒 -->
          <DurationAssertion guiclass="DurationAssertionGui" testclass="DurationAssertion" testname="响应时间&lt;1000ms" enabled="true">
            <intProp name="DurationAssertion.duration">1000</intProp>
            <stringProp name="DurationAssertion.duration_test_message">响应时间超过1秒</stringProp>
          </DurationAssertion>
          <hashTree/>
        </hashTree>

        <!-- 聚合报告 -->
        <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="聚合报告-负载测试" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="filename">reports/load-test-product-list.jtl</stringProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>

      <!-- ==================== 线程组2: 压力测试 ==================== -->
      <ThreadGroup guiclass="SteppingThreadGroupGui" testclass="ThreadGroup" testname="TG2-压力测试-创建订单" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControllerGui" testclass="LoopController" testname="循环控制器" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">500</stringProp>
        <stringProp name="ThreadGroup.ramp_time">0</stringProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">60</stringProp>

        <!-- Stepping Thread Group 配置 -->
        <stringProp name="SteppingThreadGroup.starting_delay">0</stringProp>
        <stringProp name="SteppingThreadGroup.shutdown_time">0</stringProp>
      </ThreadGroup>

      <hashTree>
        <!-- 登录获取Token -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="登录获取Token" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="用户定义变量" enabled="true">
            <collectionProp name="Arguments.arguments">
              <elementProp name="username" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">true</boolProp>
                <stringProp name="Argument.value">stresstest</stringProp>
                <stringProp name="Argument.name">username</stringProp>
                <boolProp name="HTTPArgument.use_equals">true</boolProp>
              </elementProp>
              <elementProp name="password" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">true</boolProp>
                <stringProp name="Argument.value">password123</stringProp>
                <stringProp name="Argument.name">password</stringProp>
                <boolProp name="HTTPArgument.use_equals">true</boolProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">localhost</stringProp>
          <stringProp name="HTTPSampler.port">9000</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/api/user/login</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
        </HTTPSamplerProxy>

        <hashTree>
          <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="JSON提取器-Token" enabled="true">
            <stringProp name="JSONPostProcessor.referenceNames">authToken</stringProp>
            <stringProp name="JSONPostProcessor.jsonPathExprs">$.data.token</stringProp>
          </JSONPostProcessor>
          <hashTree/>
          <BeanShellPostProcessor guiclass="BeanShellPostProcessorGui" testclass="BeanShellPostProcessor" testname="保存Token" enabled="true">
            <stringProp name="BeanShellPostProcessor.script">${__setProperty(token, ${authToken})}</stringProp>
          </BeanShellPostProcessor>
          <hashTree/>
        </hashTree>

        <!-- 创建订单请求 -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="POST /api/order/create" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{"userId":1,"productId":1,"quantity":1}</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">localhost</stringProp>
          <stringProp name="HTTPSampler.port">9000</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <stringProp name="HTTPSampler.path">/api/order/create</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <stringProp name="HTTPSampler.connect_timeout">5000</stringProp>
          <stringProp name="HTTPSampler.response_timeout">10000</stringProp>
          <stringProp name="HTTPSampler.header_manager">HeaderManager</stringProp>
        </HTTPSamplerProxy>

        <hashTree>
          <!-- Header Manager: Authorization -->
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Authorization</stringProp>
                <stringProp name="Header.value">Bearer ${__property(token)}</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>

          <!-- 响应断言: 状态码200或Sentinel限流 -->
          <ResponseAssertion guiclass="ResponseAssertionGui" testclass="ResponseAssertion" testname="响应状态码检查" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="0">200</stringProp>
              <stringProp name="1">429</stringProp>
              <stringProp name="2">503</stringProp>
            </collectionProp>
            <stringProp name="Assertion.custom_message">响应状态码应为200/429/503</stringProp>
            <stringProp name="Assertion.test_type">Contains</stringProp>
            <intProp name="Assertion.test_field">ResponseCode</intProp>
          </ResponseAssertion>
          <hashTree/>

          <!-- 响应断言: 不含未知error -->
          <ResponseAssertion guiclass="ResponseAssertionGui" testclass="ResponseAssertion" testname="不含未知error" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="0">error</stringProp>
            </collectionProp>
            <stringProp name="Assertion.custom_message">响应不应包含未知error</stringProp>
            <stringProp name="Assertion.test_type">NotContains</stringProp>
            <intProp name="Assertion.test_field">ResponseData</intProp>
          </ResponseAssertion>
          <hashTree/>

          <!-- 提取Sentinel限流标志 -->
          <JSONPostProcessor guiclass="JSONPostProcessorGui" testclass="JSONPostProcessor" testname="检测Sentinel限流" enabled="true">
            <stringProp name="JSONPostProcessor.referenceNames">sentinelBlocked</stringProp>
            <stringProp name="JSONPostProcessor.jsonPathExprs">$.message</stringProp>
          </JSONPostProcessor>
          <hashTree/>
        </hashTree>

        <!-- 聚合报告-压力测试 -->
        <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="聚合报告-压力测试" enabled="true">
          <boolProp name="ResultCollector.error_logging">true</boolProp>
          <stringProp name="filename">reports/stress-test-orders.jtl</stringProp>
        </ResultCollector>
        <hashTree/>

        <!-- 后端监听器 -->
        <BackendListener guiclass="BackendListenerGui" testclass="BackendListener" testname="Backend Listener" enabled="true">
          <elementProp name="Arguments" elementType="Arguments" name="arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="graphImplementation" elementType="Argument">
                <stringProp name="Argument.name">graphImplementation</stringProp>
                <stringProp name="Argument.value">org.apache.jmeter.visualizers.backend.graphite.InfluxdbRawBackendListenerClient</stringProp>
              </elementProp>
              <elementProp name="influxdbMetricsSender" elementType="Argument">
                <stringProp name="Argument.name">influxdbMetricsSender</stringProp>
                <stringProp name="Argument.value">org.apache.jmeter.visualizers.backend.influxdb.InfluxdbMetricsSender</stringProp>
              </elementProp>
              <elementProp name="influxdbUrl" elementType="Argument">
                <stringProp name="Argument.name">influxdbUrl</stringProp>
                <stringProp name="Argument.value">http://localhost:8086/write?db=jmeter</stringProp>
              </elementProp>
              <elementProp name="application" elementType="Argument">
                <stringProp name="Argument.name">application</stringProp>
                <stringProp name="Argument.value">e-mall-stress-test</stringProp>
              </elementProp>
              <elementProp name="measurement" elementType="Argument">
                <stringProp name="Argument.name">measurement</stringProp>
                <stringProp name="Argument.value">jmeter</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </BackendListener>
        <hashTree/>

        <!-- 响应时间分布图 -->
        <ResultCollector guiclass="RespTimeDistributionVisualizer" testclass="ResultCollector" testname="响应时间分布" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="filename">reports/resp-time-distribution.png</stringProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>

      <!-- ==================== 配置元件: HTTP请求默认值 ==================== -->
      <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP请求默认值" enabled="true">
        <stringProp name="HTTPSampler.domain">localhost</stringProp>
        <stringProp name="HTTPSampler.port">9000</stringProp>
        <stringProp name="HTTPSampler.protocol">http</stringProp>
        <stringProp name="HTTPSampler.contentEncoding">UTF-8</stringProp>
        <stringProp name="HTTPSampler.connect_timeout">10000</stringProp>
        <stringProp name="HTTPSampler.response_timeout">30000</stringProp>
      </ConfigTestElement>

      <!-- ==================== 配置元件: Cookie Manager ==================== -->
      <CookieManager guiclass="CookiePanel" testclass="CookieManager" testname="HTTP Cookie Manager" enabled="true">
        <collectionProp name="CookieManager.cookies">
          <elementProp name="Cookie" elementType="Cookie" testname="Cookie" enabled="true">
            <boolProp name="Cookie.secure">false</boolProp>
            <longProp name="Cookie.expires">0</longProp>
            <boolProp name="Cookie.pathcurrdir">true</boolProp>
            <boolProp name="Cookie.version">0</boolProp>
          </elementProp>
        </collectionProp>
        <boolProp name="CookieManager.clearEachIteration">true</boolProp>
      </CookieManager>

    </hashTree>
  </hashTree>
</jmeterTestPlan>